---
title: RoutingConditions
classe: Autodesk.Revit.DB.RoutingConditions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# RoutingConditions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `RoutingPreferenceErrorLevel ErrorLevel { get; set; }` | `routingConditions.ErrorLevel` | RoutingPreferenceErrorLevel |
| `Boolean IsValidObject { get; }` | `routingConditions.IsValidObject` | Boolean |
| `PreferredJunctionType PreferredJunctionType { get; set; }` | `routingConditions.PreferredJunctionType` | PreferredJunctionType |
| `Void AppendCondition(RoutingCondition)` | `routingConditions.AppendCondition(condition)` | Void |
| `Void Clear()` | `routingConditions.Clear()` | Void |
| `Void Dispose()` | `routingConditions.Dispose()` | Void |
| `RoutingCondition GetConditionAt(Int32)` | `routingConditions.GetConditionAt(index)` | RoutingCondition |
| `Int32 GetNumberOfConditions()` | `routingConditions.GetNumberOfConditions()` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```